<div style="direction:rtl;line-height:300%;"><font face="XB Zar" size=5>
<div align=center>
   <br>
    <font face="IranNastaliq" size=28>
    <p></p>
    In the name of God  
    </font>
    <br><br><br>
    <font face="B Nazanin" size=6 color=blue>
    Python for Data Mining<br>      </font>
    <font face="B Nazanin" size=5 color=blue> 
        Insurance Research Center
    </font>
    <br>
    <br>
    <br>
    <font face="B Nazanin" size=5 color=#FF7500>
    Khayyam Salehi 
    </font>
    <br>       
    <font face="B Nazanin" size=4 color=#FF7500>
    Assistant Professor
    <br>
    Department of Computer science
    <br>
    Shahrekord University
    </font>
    <br>    <br>
</div>

<hr style="border:2px solid black"> </hr>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('./data/tips.csv',verbose=True)

Tokenization took: 0.00 ms
Type conversion took: 0.00 ms
Parser memory cleanup took: 0.00 ms

In [3]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

* References
    * Bryant, P. G. and Smith, M (1995) Practical Data Analysis: Case Studies in Business Statistics. Homewood, IL: Richard D. Irwin Publishing:
    
* Filled with some additional columns with Fake data, including Name, CC Number, and Payment ID.

* Source: www.pieriandata.com

In [4]:
df.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

In [5]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15

# Dataframe

## Methods (continued)

In [6]:
def expensive(price):
    if price < 10:
        return '$'
    elif price >= 10 and price < 30:
        return '$$'
    else:
        return '$$$'

In [7]:
df['Expensive'] = df['total_bill'].apply(expensive)

In [8]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,$$
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,$$
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,$$
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,$$
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,$$

<a id='sort'></a>
### sort_values()

In [9]:
df.sort_values('tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455,$
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032,$$
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780,$
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801,$
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,$$
...,...,...,...,...,...,...,...,...,...,...,...,...
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,$$$
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,$$$
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,$$$
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,$$$
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,$$$

In [10]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,$$
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,$$
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,$$
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,$$
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,$$

In [11]:
# https://stackoverflow.com/questions/13148429/how-to-change-the-order-of-dataframe-columns
df.sort_values(['tip','size'])

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455,$
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801,$
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780,$
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032,$$
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,$$
...,...,...,...,...,...,...,...,...,...,...,...,...
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,$$$
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,$$$
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,$$$
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,$$$
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,$$$

<a id='corr'></a>
### Correlation checks

[Wikipedia on Correlation](https://en.wikipedia.org/wiki/Correlation_and_dependence)

In [12]:
df.corr()

                  total_bill       tip      size  price_per_person  CC Number
total_bill          1.000000  0.675734  0.598315          0.647554   0.104576
tip                 0.675734  1.000000  0.489299          0.347405   0.110857
size                0.598315  0.489299  1.000000         -0.175359  -0.030239
price_per_person    0.647554  0.347405 -0.175359          1.000000   0.135240
CC Number           0.104576  0.110857 -0.030239          0.135240   1.000000

In [13]:
df[['total_bill','tip']].corr()

            total_bill       tip
total_bill    1.000000  0.675734
tip           0.675734  1.000000

### idxmax, idxmin

In [14]:
print(df['total_bill'].max())
print(df['total_bill'].idxmax())

50.81
170

In [15]:
df.iloc[170]

total_bill                     50.81
tip                             10.0
sex                             Male
smoker                           Yes
day                              Sat
time                          Dinner
size                               3
price_per_person               16.94
Payer Name             Gregory Clark
CC Number           5473850968388236
Payment ID                   Sat1954
Expensive                        $$$
Name: 170, dtype: object

In [16]:
df['total_bill'].idxmin()

67

In [17]:
df.iloc[67]

total_bill                      3.07
tip                              1.0
sex                           Female
smoker                           Yes
day                              Sat
time                          Dinner
size                               1
price_per_person                3.07
Payer Name             Tiffany Brock
CC Number           4359488526995267
Payment ID                   Sat3455
Expensive                          $
Name: 67, dtype: object

### value_counts
for categorical columns

In [20]:
df['size'].value_counts()

2    156
3     38
4     37
5      5
1      4
6      4
Name: size, dtype: int64

### replace

In [21]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,$$
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,$$
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,$$
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,$$
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,$$

In [22]:
df['Expensive'].replace(to_replace='$$',value='OOk')

0      OOk
1      OOk
2      OOk
3      OOk
4      OOk
      ...
239    OOk
240    OOk
241    OOk
242    OOk
243    OOk
Name: Expensive, Length: 244, dtype: object

In [23]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,$$
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,$$
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,$$
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,$$
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,$$

In [24]:
df['Expensive'].replace(to_replace='$$',value='OOk',inplace = True)

In [25]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,OOk
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,OOk
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,OOk
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,OOk
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,OOk

### unique

In [26]:
df['size'].unique()

array([2, 3, 4, 1, 6, 5], dtype=int64)

In [27]:
df['size'].nunique()

6

In [28]:
df['sex'].unique()

array(['Female', 'Male'], dtype=object)

In [29]:
df['sex'].nunique()

2

In [30]:
df['time'].unique()

array(['Dinner', 'Lunch'], dtype=object)

In [31]:
df['time'].nunique()

2

### map

In [32]:
my_map = {'Dinner':'D','Lunch':'L'}
df['time'].map(my_map)

0      D
1      D
2      D
3      D
4      D
      ..
239    D
240    D
241    D
242    D
243    D
Name: time, Length: 244, dtype: object

<a id='dup'></a>
### Duplicates

#### .duplicated() and .drop_duplicates()

In [33]:
# Returns True for the 1st instance of a duplicated row
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Length: 244, dtype: bool

In [34]:
simple_df = pd.DataFrame([1,2,2],['a','b','c'])
simple_df

   0
a  1
b  2
c  2

In [35]:
simple_df.duplicated()

a    False
b    False
c     True
dtype: bool

In [36]:
simple_df.drop_duplicates()

   0
a  1
b  2

<a id='bet'></a>
### between

left: A scalar value that defines the left boundary <br>
right: A scalar value that defines the right boundary<br>
inclusive: A Boolean value which is True by default. If False, it excludes the two passed arguments while checking.

In [37]:
df['total_bill'].between(10,20,inclusive=True)

0       True
1       True
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242     True
243     True
Name: total_bill, Length: 244, dtype: bool

In [38]:
df[df['total_bill'].between(10,20,inclusive=True)]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,OOk
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,OOk
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820,OOk
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775,OOk
10,10.27,1.71,Male,No,Sun,Dinner,2,5.14,William Riley,566287581219,Sun2546,OOk
...,...,...,...,...,...,...,...,...,...,...,...,...
234,15.53,3.00,Male,Yes,Sat,Dinner,2,7.76,Tracy Douglas,4097938155941930,Sat7220,OOk
235,10.07,1.25,Male,No,Sat,Dinner,2,5.04,Sean Gonzalez,3534021246117605,Sat4615,OOk
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032,OOk
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17,OOk
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672,OOk

### sample

In [48]:
df.sample(5)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
30,9.55,1.45,Male,No,Sat,Dinner,2,4.78,Grant Hall,30196517521548,Sat4099,$
178,9.60,4.00,Female,Yes,Sun,Dinner,2,4.80,Melanie Gray,4211808859168,Sun4598,$
41,17.46,2.54,Male,No,Sun,Dinner,2,8.73,David Boyer,3536678244278149,Sun9460,OOk
93,16.32,4.30,Female,Yes,Fri,Dinner,2,8.16,Natalie Nguyen,5181236182893396,Fri6963,OOk
115,17.31,3.50,Female,No,Sun,Dinner,2,8.65,Kayla Stone,379494319310858,Sun8746,OOk

In [58]:
df.sample(5,weights=df['size'])

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
149,7.51,2.00,Male,No,Thur,Lunch,2,3.76,Daniel Robbins,4823139288341889,Thur6321,$
77,27.20,4.00,Male,No,Thur,Lunch,4,6.80,John Davis,30344778738589,Thur4924,OOk
211,25.89,5.16,Male,Yes,Sat,Dinner,4,6.47,Christopher Li,6011962464150569,Sat6735,OOk
189,23.10,4.00,Male,Yes,Sun,Dinner,3,7.70,Richard Stevens,3560193117506187,Sun1821,OOk
108,18.24,3.76,Male,No,Sat,Dinner,2,9.12,Steven Grant,4112810433473856,Sat6376,OOk

In [60]:
df.sample(frac=0.03)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
131,20.27,2.83,Female,No,Thur,Lunch,2,10.14,Ashley Burke,5394652998970066,Thur9005,OOk
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,OOk
155,29.85,5.14,Female,No,Sun,Dinner,5,5.97,Madison Wilson,4210875236164664,Sun9176,OOk
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677,$$$
193,15.48,2.02,Male,Yes,Thur,Lunch,2,7.74,Raymond Sullivan,180068856139315,Thur606,OOk
206,26.59,3.41,Male,Yes,Sat,Dinner,3,8.86,Daniel Owens,38971087967574,Sat1,OOk
18,16.97,3.50,Female,No,Sun,Dinner,3,5.66,Laura Martinez,30422275171379,Sun2789,OOk

<a id='n'></a>
### nlargest and nsmallest

In [61]:
df.nlargest(10,'tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,$$$
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,$$$
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,$$$
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,$$$
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,$$$
183,23.17,6.50,Male,Yes,Sun,Dinner,4,5.79,Dr. Michael James,4718501859162,Sun6059,OOk
214,28.17,6.50,Female,Yes,Sat,Dinner,3,9.39,Marissa Jackson,4922302538691962,Sat3374,OOk
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677,$$$
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,OOk
88,24.71,5.85,Male,No,Thur,Lunch,2,12.36,Roger Taylor,4410248629955,Thur9003,OOk

In [62]:
df.nsmallest(10,'tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,Expensive
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455,$
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780,$
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801,$
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032,OOk
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,OOk
215,12.90,1.10,Female,Yes,Sat,Dinner,2,6.45,Jessica Owen,4726904879471,Sat6983,OOk
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929,$$$
75,10.51,1.25,Male,No,Sat,Dinner,2,5.26,Kenneth Hayes,213142079731108,Sat5056,OOk
135,8.51,1.25,Female,No,Thur,Lunch,2,4.26,Rebecca Harris,4320272020376174,Thur6600,$
235,10.07,1.25,Male,No,Sat,Dinner,2,5.04,Sean Gonzalez,3534021246117605,Sat4615,OOk

# Missing Data

## Ways to handle missing values:

* Keep it
    * *The easiest one*
    * *Not supported with the most ML methods*


* Remove it
    * *Easy to do*
    * *Lose a lot of data*
    * *Drop a row or a column when a lot of information is missing.*


* Replace it
    * *The hardest to do*
    * *Lead to false conclusion*
    * *Fill with the same value where NaN was a placeholder*
    * *Fill with interpolated or estimated value*

*There is no an absolute approach!*

## What Null/NA/nan objects look like:

Source: https://github.com/pandas-dev/pandas/issues/28095

A new pd.NA value (singleton) is introduced to represent scalar missing values.
* np.nan for float data
* np.nan or None for object-dtype data
* pd.NaT for datetime-like data

In [63]:
np.nan

nan

In [64]:
pd.NaT

NaT

In [65]:
pd.NA

**Comparisons should be avoided with Missing Values**

*three-valued logic*

In [66]:
np.nan == np.nan

False

In [67]:
np.nan != np.nan

True

In [68]:
np.nan in [np.nan]

True

In [69]:
np.nan is [np.nan]

False

In [70]:
np.nan is np.nan

True

In [71]:
pd.NA == pd.NA

In [72]:
pd.NA != pd.NA

In [73]:
df = pd.read_csv('./data/movie_scores.csv')
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [74]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [75]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [76]:
df['first_name']

0      Tom
1      NaN
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object

In [77]:
df[df['first_name'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [78]:
df[(df['pre_movie_score'].isnull()) & df['sex'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0   m              NaN               NaN

## Drop data

In [79]:
help(df.dropna)

Help on method dropna in module pandas.core.frame:

dropna(axis=0, how='any', thresh=None, subset=None, inplace=False) method of pandas.core.frame.DataFrame instance
    Remove missing values.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Determine if rows or columns which contain missing values are
        removed.

        * 0, or 'index' : Drop rows which contain missing values.
        * 1, or 'columns' : Drop columns which contain missing value.

        .. versionchanged:: 1.0.0

           Pass tuple or list to drop on multiple axes.
           Only a single axis is allowed.

    how : {'any', 'all'}, default 'any'
        Determine if row or column is removed from DataFrame, when we have
        at least one NA or all NA.

        * 'any' : If any NA values are present, drop that row or column.
        * 'all' : If all values are NA, drop that row or column.

    thresh : int, optional
        Require that many non-NA values.
    subset : array-like, optional
        Labels along other axis to consider, e.g. if you are dropping rows
        these would be a list of columns to include.
    inplace : bool, default False
        If True, do operation inplace and return None.

    Returns
    -------
    DataFrame or None
        DataFrame with NA entries dropped from it or None if ``inplace=True``.

    See Also
    --------
    DataFrame.isna: Indicate missing values.
    DataFrame.notna : Indicate existing (non-missing) values.
    DataFrame.fillna : Replace missing values.
    Series.dropna : Drop missing values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
    ...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    ...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
    ...                             pd.NaT]})
    >>> df
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Drop the rows where at least one element is missing.

    >>> df.dropna()
         name        toy       born
    1  Batman  Batmobile 1940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'toy'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep the DataFrame with valid entries in the same variable.

    >>> df.dropna(inplace=True)
    >>> df
         name        toy       born
    1  Batman  Batmobile 1940-04-25

In [80]:
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [93]:
df.dropna(thresh=0.9*len(df.columns))

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [83]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [88]:
len(df.columns)

6

In [85]:
df.dropna(axis=1, thresh=4)

  first_name last_name   age  sex
0        Tom     Hanks  63.0    m
1        NaN       NaN   NaN  NaN
2       Hugh   Jackman  51.0    m
3      Oprah   Winfrey  66.0    f
4       Emma     Stone  31.0    f

## Fill Data

In [94]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [95]:
df.fillna("NEW VALUE!")

,first_name,last_name,age,sex,pre_movie_score,post_movie_score
0,Tom,Hanks,63.0,m,8.0,10.0
1,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!,NEW VALUE!
2,Hugh,Jackman,51.0,m,NEW VALUE!,NEW VALUE!
3,Oprah,Winfrey,66.0,f,6.0,8.0
4,Emma,Stone,31.0,f,7.0,9.0

In [96]:
df['first_name'].fillna("Empty")

0      Tom
1    Empty
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object

In [97]:
df['first_name'] = df['first_name'].fillna("Empty")

In [98]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1      Empty       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [99]:
df['pre_movie_score'].mean()

7.0

In [100]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [101]:
df['pre_movie_score'].mean()

7.0

In [103]:
df.mean()

age                 52.75
pre_movie_score      7.00
post_movie_score     9.00
dtype: float64

In [102]:
df.fillna(df.mean())

  first_name last_name    age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.00    m              8.0              10.0
1      Empty       NaN  52.75  NaN              7.0               9.0
2       Hugh   Jackman  51.00    m              7.0               9.0
3      Oprah   Winfrey  66.00    f              6.0               8.0
4       Emma     Stone  31.00    f              7.0               9.0

In [104]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1      Empty       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

## Filling with Interpolation

Be careful with this technique

* understand whether or not this is a valid choice
* the default is a linear method.

Documents:
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.interpolate.html

In [105]:
s = pd.Series([np.nan, "single_one", np.nan, "fill_two_more", np.nan, 
               np.nan, np.nan, 4.71, np.nan])
s

0              NaN
1       single_one
2              NaN
3    fill_two_more
4              NaN
5              NaN
6              NaN
7             4.71
8              NaN
dtype: object

In [106]:
s.interpolate()

0              NaN
1       single_one
2              NaN
3    fill_two_more
4              NaN
5              NaN
6              NaN
7             4.71
8              NaN
dtype: object

In [107]:
s.interpolate(method='pad')

0              NaN
1       single_one
2       single_one
3    fill_two_more
4    fill_two_more
5    fill_two_more
6    fill_two_more
7             4.71
8             4.71
dtype: object

In [108]:
s.interpolate(method='pad', limit=1)

0              NaN
1       single_one
2       single_one
3    fill_two_more
4    fill_two_more
5              NaN
6              NaN
7             4.71
8             4.71
dtype: object

In [109]:
s = pd.Series([0, 2, np.nan, 8])
s

0    0.0
1    2.0
2    NaN
3    8.0
dtype: float64

In [110]:
s.interpolate(method='polynomial', order=1)

0    0.0
1    2.0
2    5.0
3    8.0
dtype: float64

In [113]:
s.interpolate(method='polynomial', order=2)

0    0.000000
1    2.000000
2    4.666667
3    8.000000
dtype: float64

In [114]:
s.interpolate(method='polynomial', order=3)

ValueError: The number of derivatives at boundaries does not match: expected 1, got 0+0

In [115]:
df = pd.DataFrame([(0.0, np.nan, -1.0, 1.0),
                   (np.nan, 2.0, np.nan, np.nan),
                   (2.0, 3.0, np.nan, 9.0),
                   (np.nan, 4.0, -4.0, 16.0)],
                  columns=list('abcd'))
df

     a    b    c     d
0  0.0  NaN -1.0   1.0
1  NaN  2.0  NaN   NaN
2  2.0  3.0  NaN   9.0
3  NaN  4.0 -4.0  16.0

In [116]:
df.interpolate(method='linear', limit_direction='forward', axis=0)

     a    b    c     d
0  0.0  NaN -1.0   1.0
1  1.0  2.0 -2.0   5.0
2  2.0  3.0 -3.0   9.0
3  2.0  4.0 -4.0  16.0

In [117]:
df.interpolate(method='linear', limit_direction='both', axis=0)

     a    b    c     d
0  0.0  2.0 -1.0   1.0
1  1.0  2.0 -2.0   5.0
2  2.0  3.0 -3.0   9.0
3  2.0  4.0 -4.0  16.0

In [118]:
df['d'].interpolate(method='polynomial', order=2)

0     1.0
1     4.0
2     9.0
3    16.0
Name: d, dtype: float64

In [119]:
airline_tix = {'first':100,'business':np.nan,'economy-plus':50,'economy':30}
ser = pd.Series(airline_tix)
ser

first           100.0
business          NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [120]:
ser.interpolate()

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64

In [121]:
ser

first           100.0
business          NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [122]:
ser.interpolate(method='spline')

ValueError: Index column must be numeric or datetime type when using spline method other than linear. Try setting a numeric or datetime index column before interpolating.

In [123]:
df = pd.DataFrame(ser,columns=['Price'])
df

              Price
first         100.0
business        NaN
economy-plus   50.0
economy        30.0

In [124]:
df.interpolate()

              Price
first         100.0
business       75.0
economy-plus   50.0
economy        30.0

In [125]:
df = df.reset_index()
df

          index  Price
0         first  100.0
1      business    NaN
2  economy-plus   50.0
3       economy   30.0

In [127]:
df.interpolate(method='spline',order=2)

          index       Price
0         first  100.000000
1      business   73.333333
2  economy-plus   50.000000
3       economy   30.000000

# Groupby Operations and Multi-level Index

In [128]:
df = pd.read_csv('./data/tips.csv')
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

## groupby() method

In [129]:
# Creates a groupby object waiting for an aggregate method
df.groupby('sex')

#### Adding an aggregate method call.

To use a grouped object, you need to tell pandas how you want to aggregate the data.

Common Options:

    mean(): Compute mean of groups
    sum(): Compute sum of group values
    size(): Compute group sizes
    count(): Compute count of group
    std(): Standard deviation of groups
    var(): Compute variance of groups
    sem(): Standard error of the mean of groups
    describe(): Generates descriptive statistics
    first(): Compute first of group values
    last(): Compute last of group values
    nth() : Take nth value, or a subset if n is a list
    min(): Compute min of group values
    max(): Compute max of group values
    
Online Documentation: https://pandas.pydata.org/docs/reference/groupby.html

In [130]:
# sex becomes the index! It is NOT a column name,it is now the name of the index
df.groupby('sex').mean()

        total_bill       tip      size  price_per_person     CC Number
sex
Female   18.056897  2.833448  2.459770          7.464368  2.450499e+15
Male     20.744076  3.089618  2.630573          8.123057  2.626112e+15

In [131]:
s_group = df.groupby('sex').mean()
s_group

        total_bill       tip      size  price_per_person     CC Number
sex
Female   18.056897  2.833448  2.459770          7.464368  2.450499e+15
Male     20.744076  3.089618  2.630573          8.123057  2.626112e+15

In [132]:
s_group.columns

Index(['total_bill', 'tip', 'size', 'price_per_person', 'CC Number'], dtype='object')

In [133]:
s_group.index

Index(['Female', 'Male'], dtype='object', name='sex')

In [134]:
df.groupby('sex').describe()

       total_bill                                                         \
            count       mean       std   min    25%    50%    75%    max
sex
Female       87.0  18.056897  8.009209  3.07  12.75  16.40  21.52  44.30
Male        157.0  20.744076  9.246469  7.25  14.00  18.35  24.71  50.81

          tip            ... price_per_person        CC Number                \
        count      mean  ...              75%    max     count          mean
sex                      ...
Female   87.0  2.833448  ...            8.725  14.77      87.0  2.450499e+15
Male    157.0  3.089618  ...            9.680  20.27     157.0  2.626112e+15

                                                                              \
                 std           min           25%           50%           75%
sex
Female  2.326826e+15  6.046330e+10  4.859865e+12  3.508912e+15  4.447818e+15
Male    2.397656e+15  6.040679e+10  3.623118e+13  3.527691e+15  4.563054e+15


                 max
sex
Female  6.542729e+15
Male    6.596454e+15

[2 rows x 40 columns]

In [135]:
df.groupby('sex').describe().transpose()

sex                           Female          Male
total_bill       count  8.700000e+01  1.570000e+02
                 mean   1.805690e+01  2.074408e+01
                 std    8.009209e+00  9.246469e+00
                 min    3.070000e+00  7.250000e+00
                 25%    1.275000e+01  1.400000e+01
                 50%    1.640000e+01  1.835000e+01
                 75%    2.152000e+01  2.471000e+01
                 max    4.430000e+01  5.081000e+01
tip              count  8.700000e+01  1.570000e+02
                 mean   2.833448e+00  3.089618e+00
                 std    1.159495e+00  1.489102e+00
                 min    1.000000e+00  1.000000e+00
                 25%    2.000000e+00  2.000000e+00
                 50%    2.750000e+00  3.000000e+00
                 75%    3.500000e+00  3.760000e+00
                 max    6.500000e+00  1.000000e+01
size             count  8.700000e+01  1.570000e+02
                 mean   2.459770e+00  2.630573e+00
                 std    9.376442e-01  9.559974e-01
                 min    1.000000e+00  1.000000e+00
                 25%    2.000000e+00  2.000000e+00
                 50%    2.000000e+00  2.000000e+00
                 75%    3.000000e+00  3.000000e+00
                 max    6.000000e+00  6.000000e+00
price_per_person count  8.700000e+01  1.570000e+02
                 mean   7.464368e+00  8.123057e+00
                 std    2.461255e+00  3.119916e+00
                 min    2.880000e+00  3.450000e+00
                 25%    5.685000e+00  5.860000e+00
                 50%    6.710000e+00  7.600000e+00
                 75%    8.725000e+00  9.680000e+00
                 max    1.477000e+01  2.027000e+01
CC Number        count  8.700000e+01  1.570000e+02
                 mean   2.450499e+15  2.626112e+15
                 std    2.326826e+15  2.397656e+15
                 min    6.046330e+10  6.040679e+10
                 25%    4.859865e+12  3.623118e+13
                 50%    3.508912e+15  3.527691e+15
                 75%    4.447818e+15  4.563054e+15
                 max    6.542729e+15  6.596454e+15

## Groupby Multiple Columns
Let's explore average tip per sex per size

In [136]:
ss = df.groupby(['sex','size']).mean()

In [137]:
ss['tip']

sex     size
Female  1       1.276667
        2       2.528448
        3       3.250000
        4       4.021111
        5       5.140000
        6       4.600000
Male    1       1.920000
        2       2.614184
        3       3.476667
        4       4.172143
        5       3.750000
        6       5.850000
Name: tip, dtype: float64

In [138]:
ss.index

MultiIndex([('Female', 1),
            ('Female', 2),
            ('Female', 3),
            ('Female', 4),
            ('Female', 5),
            ('Female', 6),
            (  'Male', 1),
            (  'Male', 2),
            (  'Male', 3),
            (  'Male', 4),
            (  'Male', 5),
            (  'Male', 6)],
           names=['sex', 'size'])

In [139]:
ss.index.levels

FrozenList([['Female', 'Male'], [1, 2, 3, 4, 5, 6]])

In [140]:
ss.index.names

FrozenList(['sex', 'size'])

In [141]:
ss

             total_bill       tip  price_per_person     CC Number
sex    size
Female 1       6.796667  1.276667          6.796667  2.639780e+15
       2      15.339483  2.528448          7.670172  2.338464e+15
       3      21.547143  3.250000          7.182143  2.826916e+15
       4      30.278889  4.021111          7.571111  2.872289e+15
       5      29.850000  5.140000          5.970000  4.210875e+15
       6      28.425000  4.600000          4.740000  2.407453e+12
Male   1       8.580000  1.920000          8.580000  3.505303e+15
       2      17.104082  2.614184          8.551633  2.635100e+15
       3      24.287083  3.476667          8.095833  3.213786e+15
       4      28.078214  4.172143          7.018929  2.042482e+15
       5      30.122500  3.750000          6.025000  2.296092e+15
       6      41.235000  5.850000          6.875000  3.524834e+15

In [142]:
ss.loc['Male']

      total_bill       tip  price_per_person     CC Number
size
1       8.580000  1.920000          8.580000  3.505303e+15
2      17.104082  2.614184          8.551633  2.635100e+15
3      24.287083  3.476667          8.095833  3.213786e+15
4      28.078214  4.172143          7.018929  2.042482e+15
5      30.122500  3.750000          6.025000  2.296092e+15
6      41.235000  5.850000          6.875000  3.524834e+15

In [143]:
ss.loc[('Male',3)]

total_bill          2.428708e+01
tip                 3.476667e+00
price_per_person    8.095833e+00
CC Number           3.213786e+15
Name: (Male, 3), dtype: float64

## Cross-section with .xs()

select data at a particular level of a MultiIndex.

Parameters
-------
    key : label or tuple of label
        Label contained in the index, or partially in a MultiIndex.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Axis to retrieve cross-section on.
    level : object, defaults to first n levels (n=1 or len(key))
        In case of a key partially contained in a MultiIndex, indicate
        which levels are used. Levels can be referred by label or position.

In [145]:
ss.xs(key='Male',axis=0,level='sex')

      total_bill       tip  price_per_person     CC Number
size
1       8.580000  1.920000          8.580000  3.505303e+15
2      17.104082  2.614184          8.551633  2.635100e+15
3      24.287083  3.476667          8.095833  3.213786e+15
4      28.078214  4.172143          7.018929  2.042482e+15
5      30.122500  3.750000          6.025000  2.296092e+15
6      41.235000  5.850000          6.875000  3.524834e+15

In [152]:
ss.xs(key=3,axis=0,level='size')

        total_bill       tip  price_per_person     CC Number
sex
Female   21.547143  3.250000          7.182143  2.826916e+15
Male     24.287083  3.476667          8.095833  3.213786e+15

**much easier to filter out values *before* running a groupby() call**

In [155]:
df[df['size'].isin([3,4])].groupby(['sex','size']).mean()

             total_bill       tip  price_per_person     CC Number
sex    size
Female 3      21.547143  3.250000          7.182143  2.826916e+15
       4      30.278889  4.021111          7.571111  2.872289e+15
Male   3      24.287083  3.476667          8.095833  3.213786e+15
       4      28.078214  4.172143          7.018929  2.042482e+15

## Swap Levels

* Swapping Levels: <br>
https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html#swapping-levels-with-swaplevel
* Generalized Method is reorder_levels:<br>
https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html#reordering-levels-with-reorder-levels

In [156]:
ss.swaplevel()

             total_bill       tip  price_per_person     CC Number
size sex
1    Female    6.796667  1.276667          6.796667  2.639780e+15
2    Female   15.339483  2.528448          7.670172  2.338464e+15
3    Female   21.547143  3.250000          7.182143  2.826916e+15
4    Female   30.278889  4.021111          7.571111  2.872289e+15
5    Female   29.850000  5.140000          5.970000  4.210875e+15
6    Female   28.425000  4.600000          4.740000  2.407453e+12
1    Male      8.580000  1.920000          8.580000  3.505303e+15
2    Male     17.104082  2.614184          8.551633  2.635100e+15
3    Male     24.287083  3.476667          8.095833  3.213786e+15
4    Male     28.078214  4.172143          7.018929  2.042482e+15
5    Male     30.122500  3.750000          6.025000  2.296092e+15
6    Male     41.235000  5.850000          6.875000  3.524834e+15

## Sorting MultiIndex

* https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html#sorting-a-multiindex

In [157]:
ss.sort_index(level='size',ascending=True)

             total_bill       tip  price_per_person     CC Number
sex    size
Female 1       6.796667  1.276667          6.796667  2.639780e+15
Male   1       8.580000  1.920000          8.580000  3.505303e+15
Female 2      15.339483  2.528448          7.670172  2.338464e+15
Male   2      17.104082  2.614184          8.551633  2.635100e+15
Female 3      21.547143  3.250000          7.182143  2.826916e+15
Male   3      24.287083  3.476667          8.095833  3.213786e+15
Female 4      30.278889  4.021111          7.571111  2.872289e+15
Male   4      28.078214  4.172143          7.018929  2.042482e+15
Female 5      29.850000  5.140000          5.970000  4.210875e+15
Male   5      30.122500  3.750000          6.025000  2.296092e+15
Female 6      28.425000  4.600000          4.740000  2.407453e+12
Male   6      41.235000  5.850000          6.875000  3.524834e+15

## Advanced: agg() method

The agg() method allows you to customize what aggregate functions you want per category

In [158]:
# These strings need to match up with built-in method names
df.agg(['std','mean'])

      total_bill       tip      size  price_per_person     CC Number
std     8.902412  1.383638  0.951100          2.914234  2.369340e+15
mean   19.785943  2.998279  2.569672          7.888197  2.563496e+15

In [160]:
df.agg(['std','mean'])[['size','tip']]

          size       tip
std   0.951100  1.383638
mean  2.569672  2.998279

### Specify aggregate methods per column

**agg()** is very powerful:
* pass in a dictionary 
    * the keys: the columns
    * the values: list of aggregate methods.

In [161]:
df.agg({'size':['median','mean'],'tip':['mean','std']})

            size       tip
median  2.000000       NaN
mean    2.569672  2.998279
std          NaN  1.383638

# Combining DataFrames

https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [162]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [163]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [164]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [165]:
axis0 = pd.concat([one,two],axis=0)
axis0

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [166]:
axis1 = pd.concat([one,two],axis=1)
axis1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [167]:
two.columns = one.columns
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [168]:
pd.concat([one,two],axis=0)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

## Merge

In [169]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Taghi','Naghi','Hasan','Hossein']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Naghi','Ali','Hasan','Reza']})

In [170]:
registrations

   reg_id     name
0       1    Taghi
1       2    Naghi
2       3    Hasan
3       4  Hossein

In [171]:
logins

   log_id   name
0       1  Naghi
1       2    Ali
2       3  Hasan
3       4   Reza

**`pd.merge()`**

* merge pandas DataFrames based on key columns
* similar to a SQL join
* results based on the **how** parameter.

In [ ]:
# help(pd.merge)

### Inner,Left, Right, and Outer Joins

#### Inner Join

* the key is present in **both** tables.

In [172]:
# Notice pd.merge doesn't take in a list like concat
pd.merge(registrations,logins,how='inner',on='name')

   reg_id   name  log_id
0       2  Naghi       1
1       3  Hasan       3

In [173]:
pd.merge(registrations,logins,how='inner')

   reg_id   name  log_id
0       2  Naghi       1
1       3  Hasan       3

In [ ]:
# pd.merge(registrations,logins,how='inner',on='reg_id')

#### Left Join

* match up and include all rows from Left Table.

In [174]:
pd.merge(registrations,logins,how='left')

   reg_id     name  log_id
0       1    Taghi     NaN
1       2    Naghi     1.0
2       3    Hasan     3.0
3       4  Hossein     NaN

#### Right Join

* match up and include all rows from right Table.

In [175]:
pd.merge(registrations,logins,how='right')

   reg_id   name  log_id
0     2.0  Naghi       1
1     NaN    Ali       2
2     3.0  Hasan       3
3     NaN   Reza       4

#### Outer Join

* all info found in either Left or Right Table.

In [176]:
pd.merge(registrations,logins,how='outer')

   reg_id     name  log_id
0     1.0    Taghi     NaN
1     2.0    Naghi     1.0
2     3.0    Hasan     3.0
3     4.0  Hossein     NaN
4     NaN      Ali     2.0
5     NaN     Reza     4.0

### Question?

**`pd.merge()`**